// pages/user/agreement.js

const memberAgreement = `<h3>奇点运动会员协议</h3>
<p><strong>【审慎阅读】在同意本协议签请务必审慎阅读、充分理解各项条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。</strong></p>
<p>本协议对奇点运动品牌加盟公司下的健身场馆（以下简称“奇点运动”或“场馆”）所发放的各类会员卡有效。</p>
<p>奇点运动为北京踏行天际科技发展有限公司旗下运动品牌；</p>
<p>奇点运动品牌加盟公司均为独立公司，本协议已经各公司同意由本平台统一告知；</p>
<p>就奇点运动品牌旗下加盟店所发行的会员卡，本协议对其有约束力，且本协议项下奇点运动所承担的权利义务由该店实际经营者承担。</p>
<p><strong>一、会员*</strong>*/<strong></strong>会员卡**</p>
<p>1、奇点运动采用会员制服务模式，只有取得会员方能享受场馆的各项专业健身服务及相关配套服务。</p>
<p>2、用户取得会员资格应具备中华人民共和国法律规定的与会员行为相适应的民事行为能力，并已知晓平台有关的规则与警示，承诺遵守奇点运动的相关规定，并办理入会手续。</p>
<p>3、本协议所称“会员”是指年满18周岁未满60周岁身体健康并向场馆缴纳了全部会费，能如实提供和陈述个人信息，取得本场馆发放的会员卡的人士。因此您有义务对入会时所提供资料的真实性、合法性负责。以上任何一条件不满足，奇点运动就有权拒绝向您提供服务。</p>
<p>4、若确有60周岁以上（包含60周岁）人士坚持要到奇点运动健身，为避免以后纠纷需作出以下承诺：（60周岁以上人士办理会员卡时阅读本协议后扔选择办理的，视为已对下属条款作出承诺）</p>
<p>承诺人完全知悉健身房运动存在的各项风险（包括人身、财产损失及其他可能出现的损失和风险），前述风险既可能因承诺人自己的作为、不作为或过失而造成，也可能因他人的作为、不作为或过失而造成，或者其他不可抗力因素造成。</p>
<p>承诺人会根据自身情况量力而行，对自身健康状况评估后慎重选择运动；若本人因上述风险发生而导致的任何法律后果，均由本人承担，并承诺免除健身房的法律责任。</p>
<p>承诺人保证办理会员之前已经把相关事宜详细告知了家属以及法定继承人，并且他们均同意本人上述行为。他们表示理解和认可承诺人的承诺，并会尊重和信守以上承诺涉及的法律责任，保证不会就前述的人身或财产损失向奇点运动提起任何诉讼或有关赔偿请求，若他们提起赔偿的，奇点运动可向本人予以追偿。</p>
<p><strong>二、获得会员资格</strong></p>
<p>1、原始取得，指的是在奇点运动客户端、小程序、APP或微信公众号注册、填写真实、有效、全面的个人资料，办理入会手续并缴纳会费后取得的会员资格。</p>
<p>2、继受或转让取得，指在本协议约定的特殊事由出现时，通过办理一定的手续，由非会员的第三方取得会员资格，原会员资格终止。</p>
<p>二、电子会员卡的取得方式</p>
<p>1、原始取得，指的是在奇点运动客户端、小程序、APP等注册、填写真实、有效、全面的个人资料，办理入会手续并缴纳会费后取得会员资格。</p>
<p>2、继受或转让取得，指在本协议约定的特殊事由出现时，通过办理一定的手续，由非会员的第三方取得会员资格，原会员资格终止。</p>
<p><strong>三、电子会员卡的管理</strong></p>
<p>1、会员卡仅供会员本人使用（体验卡除外），一经售出，概不退换。</p>
<p>2、会员在场馆训练时需遵守场馆规定的各项守则（相关规则将以场馆公示形式列明），严重违反场馆规章制度者，场馆有权取消其会员资格并退还剩余费用，给场馆或者第三方造成损失的，会员应承担相关的法律责任。</p>
<p>3、会员卡期满后，若会员逾期不续费缴费，场馆后台自动取消该会员的会员权限，会员资格终止。</p>
<p>4、会员卡生效日期：普通月卡/季度/年度会员卡有效期自付款成功之时生效。</p>
<p><strong>四、会员权利</strong></p>
<p>1、奇点运动采用会员制服务模式，只有取得会员方能享受场馆的各项专业健身服务及相关配套服务。 </p>
<p>2、会员权益：</p>
<p>（1）用户取得奇点运动会员资格后，可享受奇点运动场馆提供的下述权益：</p>
<p>①承诺场馆24小时营业（部分场馆因客观原因可能无法做到24小时营业，请您在购卡前仔细查看说明或咨询店长）。</p>
<p>②会员购买会员卡后仅可在相应的购卡所在店使用，会员卡无法通用（具体适用范．请您在购卡时仔细阅读购买说明或咨询店长）。</p>
<p>③常规类团操课程可无限次预约，课程种类丰富，满足不同程度的需要。</p>
<p>④店内跑步机、力量器械等多种健身器械不限用。 </p>
<p>（2）用户购买奇点运动平台入驻商家所售会员卡的，相关权益以入驻商家的公示或承诺为准。</p>
<p>3、针对场馆、课程的服务，会员有提出批评、投诉及改进建议的权利；</p>
<p>4、期满后会员有优先续约的权利；</p>
<p>5、会员可开具订单发票（具体开票规则与时间可详细咨询场馆店长）</p>
<p><strong>五、会员义务</strong> </p>
<p>1、如实向奇点运动提供个人信息资料，并在资料发生变动后及时通知奇点运动。</p>
<p>2、进入场馆时凭会员卡，随时接受工作人员验证和抽查。</p>
<p>3、场馆提供储物柜等设备，但仅用于存放水杯、衣物及其他运动所需的随身物品，贵重物品请避免带入场馆，或由您自行妥善保管。 </p>
<p>4、除特殊课程外，奇点运动不接受怀孕期间/有重大疾病/病愈后没有有效医生证明的会员（手术后3个月内的人群、有心血管疾病者、不能剧烈运动伤者、孕妇及哺乳期女性、产后不足3个月内的人群等）购买课程/训练，上述情况下奇点运动有权无条件退款退课。（本条所称特殊课程系指在奇点运动平台展示及出售的包括但不限于产后恢复等针对特殊身体状况人员开设的康复型课程，该类课程的适用规则以页面公示为准）</p>
<p>5、平台原则上不接受60周岁以上老人入会，能出具真实有效的健康证明者除外，因隐瞒或错报个人健康信息发生的一切责任都由其本人承担。 </p>
<p>6、严禁十八周岁以下儿童和孕妇进入健身区域（平台开设的青少年特色课程学员除外）。 </p>
<p>7、为了您的健身安全，请穿运动服饰、运动鞋参加运动。运动期间，不得赤裸上身或穿着不得体或违反道德规范的服饰进行运动。 </p>
<p>8、运动前严禁饮酒或饮用含酒精类饮料，因违反本条规定造成人身伤害等意外情况，本人需对此承担责任。 </p>
<p>9、禁止会员在场馆内销售任问商品，不得参与任何营利性健身指导（黑私行为），违反本条规定的，场馆有权取消其会员资格并予以退课。会员不得在奇点运动场馆内进行长时间的教学指导。包括朋友、亲人之间的过长时间互相指导，超过30分钟，持续性的教学动作奇点运动都默认等同于黑私教学行为。 </p>
<p>10、未征得场馆负责人同意，禁止在场馆内拍照、摄像或录音。 </p>
<p>11、会员在健身时应正确使用各种健身器械，以防造成意外人身伤害，如您不了解器械使用方法的，请线下咨询场馆工作人员后再行使用。</p>
<p>12、会员应自觉爱借合理使用室内各项设施、设备、使用后须归放原位．禁止将室内各项设施、设备擅自带出场馆，如有损坏、丢失场馆将追究相关人员责任。 13、严禁未预约课程，强行进入操房上操课。</p>
<p>14、严禁在健身区内吸烟、进食、吐痰、乱扔垃圾，请自觉维护健身房的环境卫生。</p>
<p>15、严禁携带宠物进入场馆。 </p>
<p>16、严禁心肺功能疾病、脊椎病、皮肤病及一切传染病患者进入场馆。 </p>
<p>17、严禁在场馆内大声喧哗，使用污言秽语以及一切违法活动。</p>
<p><strong>六、权利保留</strong></p>
<p>1、为更好地服务会员需求，奇点运动有权对相关内容进行修改，且修改后的条款自通知会员或在奇点运动客户端、 App 、小程序、微信公众号或其他传播渠道位置公示，公示期满，条款的修改即生效。</p>
<p>2、健身场馆营业时间原则上24小时，营业时间有变动，会在微信公众账号后台或者门店等传播渠道做公示，会员须遵守该营业时间。</p>
<p>3、因国家政策或者法律法规的规定，场馆有权合理修改营业时间并在店内或其他渠道公示，恕不另行通知会员，该公示即视为通知。</p>
<p>4、因经营管理需要，场馆有权调整、增减部分项目，该行为不视为违约，且在店内或其他渠道公示后即视为通知，无需另行报告给会员个人。</p>
<p>5、因器械、设备（设施）检修、维护，场馆有权在某一时间段对某一项目或某类项目采取停用或限用措施。</p>
<p>6、其他出于会员安全及集体利益的需要，场馆有权采取必要措施以恢复经营秩序。</p>
<p>7、为保障场馆内安全，奇点运动禁止会员在场馆内销售任何商品，非奇点运动平台教练不得在场馆内进行健身指导。</p>
<p><strong>七、责任分配</strong></p>
<p>出现下列情形的，场馆不予承担任何责任：</p>
<p>1、遇不可抗力因素造成场馆营业终止或会员会籍不能继续，致使会员遭受损失；</p>
<p>2、会员所受损害是因其自身故意或过失造成的；</p>
<p>3、会员所受损害是场馆工作人员以外的任何第三方的故意或过失行为导致的；</p>
<p>4、非会员不听劝阻，擅自进入或强行进入会员区域造成损害的，由其自身或致害方承担责任；</p>
<p>5、受害方严重违反场馆制定的规章制度所造成损害的；</p>
<p>6、未交由场馆保管而由会员或会员随同人员个人保管的贵重物品发生毁损、灭失、遗失的；</p>
<p>7、因会员资料或个人信息发生变动未及时通知场馆，从而造成损失或会员权利受限的；</p>
<p>8、未听从场馆工作人员指导，擅自使用或违反操作规程使用器械、设备造成自身受伤的，由自身负责；造成他人受损或场馆财产毁损的，其本人应承担全部赔偿责任，对此本场馆不承担任何责任。</p>
<p>9、因会员自身行为不当或会员之间的争议产生的人身和财产损失，本场馆不承担责任。</p>
<p><strong>八、安全提示</strong></p>
<p>1、会员在锻练前，应先做必要的热身练习，以免受伤。</p>
<p>2、过度锻炼及违规锻炼均有受伤的可能，所以您在运动前对自身身体情况进行判断，并保持运动强度和时间的适当。</p>
<p>3、对违反本协议约定从而造成物品丢失及人员伤亡的，本场馆不承担任何法律责任。</p>
<p>4、健身场馆内任何运动项目及器械设施均有严格的操作方法和程序，请务必在专业人员的指导下或者安全手册下进行操作，如有违背致使人员受损，场馆不承担任何责任。</p>
<p>5、会员进行任何单项或器械的操作均应在知晓操作方法及注意事项后进行，同时充分注意自身的身体状况及承受能力，否则因此发生任何损害，本健身场馆均不承担责任。</p>
<p><strong>九、特别声明</strong></p>
<p>在法律允许的范围内，为更好地服务会员之需要，场馆有权对相关内容进行修改，且修改后的条款自通知会员或在网站、APP，微信公众号或其他传播渠道公示后，即对全体会员产生约束力。 </p>
<p><strong>十、会员承诺</strong></p>
<p>1、本人保证所提供的入会资料及个人信息真实有效；</p>
<p>2、本人身体健康，未患有不适合接受本协议约定之服务的疾病；</p>
<p>3、本人已阅读、理解并同意上述条文。</p>
<p><strong>十一、法律适用级争议解决条款</strong></p>
<p>本合同的效力、解释、变更、执行级争议的解决等均适用中华人民共和国法律，</p>
<p>因本合同产生的任何争议，双方首先应当协商解除，如果协商不成的，应提交合同履行地人民法院裁决。</p>`;
const platformAgreement = `
<h3>奇点运动用户服务协议</h3>
<p>&nbsp;</p>
<p>尊敬的用户</p>
<p>感谢您注册使用“奇点运动”小程序/APP，为让您更好地使用“奇点运动”提供的产品和服务，请您务必审慎阅读、充分理解《奇点运动用户服务协议 》 （以下称“用户协议”或“本协议”）各条款内容，特别是免除或者限制责任的条款，并选择接受或不接受。<strong>本协议中限制、免责条款可能以加粗形式提醒您注意</strong>。</p>
<p>【授权须知】</p>
<p>为方便您在奇点运动小程序/APP上购买会员卡、参加各类运动服务，您在此确认并同意，您将使用奇点运动小程序/APP注册的用户名及密码登录本小程序/APP并享受全部服务，因此请您妥善保管用户名和密码。</p>
<h4>一、协议内容、生效、变更</h4>
<p>本协议内容包括协议正文及所有奇点运动已经发布的或将来可能发布的各类规则及产品协议。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。除另行明确声明外，任问奇点运动及其关联公司、加盟公司提供的服务（以下称为奇点运动平台服务）均受本协议约束。</p>
<p>您应当在使用奇点运动平台服务之前认真阅读全部协议内容。如您对协议有任何疑问，应向奇点运动咨询。您在同意所有协议条款并完成注册程序，才能成为本站的正式用户，您点击“我已经阅读并同意遵守 《奇点运动用户服务协议》”按钮后，本协议即生效，对双方产生约束力。</p>
<p>只要您使用奇点运动平台服务，本协议即对您产生约束，届时您不应以未阅读本协议的内容或者未获得奇点运动对您问询的解答等理由，主张本协议无效，或要求撤销本协议。您确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。</p>
<p>您承诺接受并遵守本协议的约定。如果您不同意本协议的约定，您应立即停止注册程序或停止使用奇点运动平台服务。</p>
<p>奇点运动有权根据需要不定期地制订、修改本协议及/或各类规则，并在奇点运动平台公示，不再另行单独通知用户，公示期满，立即生效。如您不同意相关变更，应当立即停止使用奇点运动平台服务．您继续使用奇点运动平台服务的，即表明您接受修订后的协议和规则。</p>
<h4>二、注册 </h4>
<p>【 注册资格 】 </p>
<p>【 一般资格 】 用户须为具有法定的相应权利能力和行为能力的自然人，能够独立承担法律责任。您完成注册程序或其他奇点运动平台同意的方式实际使用本平台服务时，即视为您确认自己具备主体资格，能够独立承担法律责任。<strong>若因您不具备主体资格，而导致的一切后果，由您及您的监护人自行承担。</strong></p>
<p>【特殊资格】</p>
<p>奇点运动平台提供的部分服务对您的购买资格有特殊约定．<strong>部分活动同一用户（符合同一设备、同一手机号、同一微信号、支付宝账号或平台有其他信息证明的，均视为同一用户）仅能参与一次（即奇点运动新人活动）</strong>，多次购买无效，奇点运动有权拒绝向您提供相应服务。</p>
<p>【注册资料】</p>
<p>·为保证您能顺利使用我们的产品及/或服务，您知悉并同意，您在使用奇点运动账号时（包括通过第三方账号授权登录）应遵守以下规则：</p>
<p>·用户应自行诚信向本站是供注册资料，用户同意其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。<strong>如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且奇点运动保留终止用户使用本平台各项服务的权利</strong>。</p>
<p>·用户在本站进行浏览、购买奇点运动产品及服务等活动时，涉及用户真实姓名 /名称、通信地址、联系电话、电子邮箱等隐私信息的，本站将予以严格保密，除非得到用户的授权或法律另有规定，本站不会向外界披露用户隐私信息。</p>
<p><strong>·除通过第三方账号授权登录外，您仅可通过我们的官方渠道注册成为我们的注册用户。您不得通过包括但不限于购买、租用、借用、分享、利用或破坏我们的注册系统及/*</strong>*或其他未经我们许可的方式获奇点运动账号及账号下所对应的权益；**</p>
<p><strong>·您享有奇点运动账号的有限使用权，您的账号仅可为个人出于非商业目的进行使用，不得以转让、出租、出借、售卖、分享或其他任何方式交由他人使用（但法律另有规定或双方另有明确约定的除外）</strong>。</p>
<p>【账户】</p>
<p>·您注册成功后，即成为奇点运动平台的会员，将持有奇点运动平台唯一编号的会员名和密码等账户信息，您可以根据本站规定改变您的密码。</p>
<p>·您设置的会员名不得侵犯或涉嫌侵犯他人合法权益。否则，奇点运动有权终止向您提供奇点运动平台服务，注销您的账户。账户注销后，相应的会员名将开放给任意用户注册登记使用。</p>
<p>·您应谨慎合理的保存、使用您的会员名和密码，应对通过您的会员名和密码实施的行为负责。除非有法律规定或司法裁定，且征得奇点运动的同意，否则，会员名和密码不得以任何方式转让、赠与或继承（与账户相关的财产权益除外）。</p>
<p>·用户不得将在本站注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。</p>
<p>·若您有以下行为，我们有权暂时中止或永久终止对您账号的使用或收回您的账号，中断或终止向您继续提供我们的部分产品及/或服务，且无需承担任何责任：</p>
<p>1、根据您的主动申请； </p>
<p>2、您违反本协议的内容的； </p>
<p>3、根据我们必须遵守的法律法规、监管政策； </p>
<p>4、我们有理由认为您的使用行为属于不合理使用情形或对我们及/或他人的合法权益造成（或可能造成）侵害的。</p>
<p>·如果发现任何非法使用等可能危及您的账户安全的情形时，您应当立即以有效方式通知奇点运动，要求奇点运动暂停相关业务，并向公安机关报案。您理解奇点运动对您的请求采取行动需要合理时间，奇点运动对在采取行动前已经产生的后果（包括但不限于您的任间损失）不承担任何责任．</p>
<p>·为方便您使用奇点运动平台服务及奇点运动加盟公司或其他组织的服务（以下称其他服务），您同意并授权奇点运动将您在注册、使用奇点运动平台服务过程中提供、形成信息传递给向您提供其他服务的奇点运动加盟公司或其他组织，或从提供其他服务的奇点运动加盟或其他组织获取您在注册、使用其他服务期间提供、形成信息。</p>
<p>【用户信息的合理使用】</p>
<p>·您同意，奇点运动平台拥有通过邮件、短信电话等形式，向在本站注册、消费用户、收货人发送订单信息、促销活动等告知信息的权利。</p>
<p>·您了解并同意，奇点运动有权应国家司法、行政等主管部门的要求，向其提供您在奇点运动平台填写的注册信息和交易记录等必要信息．如您涉嫌侵犯他人知识产权，则奇点运动亦有权在初步判断涉嫌侵权行为存在的情况下，向权利人提供您必要的身份信息。</p>
<p>·用户同意，奇点运动有权使用用户的注册信息用户名、密码等信息，登陆进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。</p>
<h4>三、奇点运动平台服务及规范 </h4>
<p>【服务概况】</p>
<p>奇点运动致力于向您提供多样的互联网及线下产品和服务，包括但不限于健身会员卡、私教、团操、训练计划等，您可以通过奇点运动平台使用、分享、购买提供的产品和服务。您在购买或取得上述产品及服务时，将与奇点运动另行签署相关产品协议，并遵守奇点运动指定的行为规范。</p>
<p>【奇点运动的替换、修改和升级】</p>
<p>为增进用户体验、完善服务内容，奇点运动有权根据您对软件的使用状态和行为开发新的服务；</p>
<p>·为改进、增强和进一步开发服务，奇点运动有权不时提供软件更新（包括软件升级替换、修改、功能强化、版本升级等形式；</p>
<p>·用户理解并同意：奇点运动有权不向您特别通知而对奇点运动进行更新，或对奇点运动的部分功能进行改变或限制。</p>
<p>·奇点运动新版本发布后，旧版本可能无法使用。奇点运动经营者不保证旧版奇点运动及相应的服务继续可用。为充分、及时使用奇点运动的服务，请您随时核对并下载最新版本．</p>
<p>【用户行为规范】 通过奇点运动平台您可以享受奇点运动及其关联公司提供的奇点运动平台服务和其它服务，在使用上述服务过程中，您同意严格遵守以下义务：</p>
<p>·不得传播或发表损害国家、社会公共利益和涉及国家安全的信息资料或言论；</p>
<p>·不利用本站从事窃取商业秘密、窃取个人信息等违法犯罪活动；</p>
<p>·不发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容；</p>
<p>·不对奇点运动平台上的任问数据作商业性利用，包括但不限于在未经奇点运动事先书面同意的情况下，以复制、传播等任何方式使用奇点运动平台上展示的资料。不使用任何装置、软件或程序干预奇点运动平台的正常运营。</p>
<p>·本站保有删除站内各类不符合法律政策或不真实的信息内容而无须通知用户的权利。</p>
<p>·您同意，若您未遵守以上规定的，本站有权作出独立判断并采取暂停或关闭用户帐号、订单等措施。</p>
<p>·经国家行政或司法机关的生效法律文书确认您存在违法或侵权行为，或者奇点运动根据自身的判断，认为您的行为涉嫌违反本协议和/或规则的条款或涉嫌违反法律法规的规定的，则奇点运动有权在本平台上公示您的该等涉嫌违法或违约行为及奇点运动已对您采取得措施。</p>
<p>·对于您在奇点运动平台上发布的涉嫌违法或涉嫌侵犯他人合法权利或违反本协议和/或规则的信息，奇点运动有权不经通知您予以删除，且按照规则的规定进</p>
<p>行处罚。</p>
<p>·对于您在奇点运动平台上实施的行为，包括您未在奇点运动平台上实施但已经对奇点运动平台及具用户产生影响的行为，奇点运动有权单方认定您行为的性质及是否构成对本协议和/或规则的违反，并采取暂停或关闭用户帐号及其他措施。</p>
<p>·对于您涉嫌违反承诺的行为对任意第三方造成损害的，您均应当以自己的名义独立承担所有的法律责任，并应确保奇点运动免于因此产生损失或增加费用。</p>
<p>·如您涉嫌违反有关法律或者本协议之规定，使奇点运动遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，您应当赔偿奇点运动因此造成的损失及（或）发生的费用，包括合理的律师费用。</p>
<p>·本协议包含了您使用奇点运动平台需遵守的一般性规范，您在使用某个奇点运动平台时还需遵守适用于该平台的特殊性规范．一般性规范如与特殊性规范不一致或有冲突，则特殊性规范具有优先效力。</p>
<h4>四、知识产权声明 </h4>
<p>·奇点运动依法享有奇点运动产品的一切合法权属（包括但不限于知识产权及所有权）。奇点运动的全部著作权及其他一切知识产权，以及与奇点运动相关的所有信息内容，包括但不限于：文字表述及其组合、图标、图饰、图标、色彩组合、界面设计、版面框架、有关数据、印刷材料、或电子文档等均受中国知识产权相关法律法规和有关的国际条约的保护。</p>
<p>·奇点运动产品及通过奇点运动产品提供的视频、游戏、技术软件等产品和信息，除用户自己上传或明确标示由第三方提供的之外，全部权力归属于奇点运动。</p>
<p>·奇点运动在涉及奇点运动产品及相关各项服务中拥有专利权、专利申请权、商标权、著作权及其他知识产权．奇点运动并未因为本协议或者因为向用户提供奇点运动以及相关产品和服务而授予用户任何与奇点运动相关的知识产权。本协议未明确授予用户的权利均由奇点运动保留。</p>
<h4>五、责任范围和责任限制 </h4>
<p>·本平台作为您进行了解、咨询、协商、交易的场所，提示您：应谨慎判断确定相关物品及/或信息的真实性、合法性和有效性。除非另有明确的书面说明，本平台不对各用户在本平台上发布的信息、内容、材料、产品和服务及各方在交易中各项义务的履行能力作任何形式的担保，法律法规另有规定的除外。</p>
<p>·奇点运动在接到您投诉、主管机关通知或按照法律法规规定，有合理的理由认为特定会员或具体交易事项可能存在重大违法或违约情形时，奇点运动可依约定依法采取相应措施。</p>
<p>·您了解并同意，奇点运动不对因下述任一情况而导致您的任何损害承担赔偿责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿。</p>
<p>第三方未经批准的使用您的账户或更改您的数据。</p>
<p>您对奇点运动平台服务的误解。</p>
<p>任何非因奇点运动的原因而引起的与奇点运动平台服务有关的其它损失。</p>
<p>由于法律规定的不可抗力，信息网络正常的设备维护，信息网络连接故障，电脑、通讯或其他系统的故障，电力故障，司法行政机关的命令或第三方的不作为及其他本平台无法控制的原因造成的本平台不能服务或延迟服务、丢失数据信息、记录的，奇点运动不承担责任．但奇点运动将协助处理相关事宜。</p>
<h4>六、协议终止</h4>
<p>您同意，出现以下情况时，奇点运动有权直接以注销账户的方式终止本协议：</p>
<p>奇点运动终止向您提供服务后，您涉嫌再一次直接或间接或以他人名义注册为奇点运动用户的；</p>
<p>您注册信息中的主要内容不真实或不准确或不及时或不完整；</p>
<p>您严重违反本协议或奇点运动与您签署的其他协议的，或根据奇点运动平台规则，奇点运动有权对您终止对您提供服务的其他情形；</p>
<p>您通过非奇点运动官方渠道或授权渠道购买、租用、借用、分享、奇点运动账号及账号下所对应的权益，利用或破坏我们的注册系统及/或其他未经我们许可的方式获得奇点运动服务权益的；</p>
<p>本协议（含规则）变更时，您明示并通知奇点运动不愿接受新的服务协议的；</p>
<p>其它奇点运动认为应当终止服务的情况；</p>
<p>您有权向奇点运动要求注销您的账户，经奇点运动审核同意的，奇点运动注销（永久冻结）您的账户，届时，您与奇点运动基于本协议的合同关系即终止。您的账自被注销（永久冻结）后，奇点运动没有义务为您保留或向您披露您账户中的任何信息，也没有义务向您或第三方转发任何您未曾阅读或发送过的信息。</p>
<p>您同意，您与奇点运动的合同关系终止后，奇点运动仍享有下列权利：</p>
<p>继续保存您的注册信息及您使用奇点运动平台服务期间的所有交易信息。</p>
<p>您在使用奇点运动平台服务期间存在违法行为或违反本协议和/或规则目的行为的，奇点运动仍可依据本协议向您主张权利。</p>
<h4>七、法律适用、管辖与其他</h4>
<p>本协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规则)。如发生本协议与适用之法律相抵触时，则这些条款将完全按照法律规定重新解释，而其它有效条款继续有效。</p>
<p><strong>因本协议履行过程中，因您使用奇点运动服务产生争议应由奇点运动与您沟通并协商处理。协商不成时，双方均同意以合同履行地人民法院为管辖法院。</strong></p>
`
Page({

  /**
   * 页面的初始数据
   */
  data: {
    scrollViewHeight: 0, 
    nodes:''
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {
    this.calculatePageHeight();
    if (options.page == "member"){
      this.setData({
        nodes: memberAgreement
      })
    } else {
      this.setData({
        nodes: platformAgreement
      })
    }
  },

  // 计算页面高度
  calculatePageHeight(){
    var screenHeight = wx.getSystemInfoSync().windowHeight
    let that = this
    // 获取导航栏高度
    let query = wx.createSelectorQuery();
    query.select('.nav-bar').boundingClientRect(navRect=>{
      that.setData({
        scrollViewHeight: screenHeight - navRect.height,
      })
    }).exec();
  },
  returnHome () {
    wx.navigateBack();
  },
})